# Author = Siromashenko Vladislav Romanovich
# Group = P3109
# Date = 05.10.2025

import re


def word_with_one_vowel(text):
    pattern = r"(?i)\b(?![а-яё-]*([аеёиоуыэюя])[а-яё-]*(?:(?!\1)[аеёиоуыэюя]))[а-яё-]*[аеёиоуыэюя][а-яё-]*\b"
    matches = [m.group(0) for m in re.finditer(pattern, text)]
    matches.sort(key=lambda w: (len(w), w.lower()))
    return matches



test_cases = [
    {
        'Ввод' : 'кот сон стол стул брат лес',
        'Вывод' : ['кот', 'лес', 'сон', 'брат', 'стол', 'стул']
    },
    {
        'Ввод' : 'молоко трава кокос',
        'Вывод' : ['кокос', 'трава', 'молоко']
    },
    {
        'Ввод' : 'окно трава дом поле вода рот',
        'Вывод' : ['дом', 'рот', 'окно', 'трава']
    },
    {
        'Ввод' : "ПрОрОК, 'бЛеСк' - ВСПЛЕСК; метро/фон? тон!",
        'Вывод' : ['тон', 'фон', 'блеск', 'пророк', 'всплеск']
    },
    {
        'Ввод': "мёд плёс тётя сёстры берёза акварель фотография",
        'Вывод': ['мёд', 'плёс']
    }
]


for test in test_cases:
    result = word_with_one_vowel(test['Ввод'])
    print(f"Ввод: {test['Ввод']}")
    print(f"Вывод: {result}")
    print(f'Программа отработала корректно: {result == test['Вывод']}\n')
